# Представьте, что вы разрабатываете компьютерную игру с текстовой графикой.
# Вам поручили создать генератор ландшафта. Напишите программу, которая
# получает на вход число N и выводит на экран числа в виде ямы


# number = int(input('Enter number: '))

number = 5

# for i in range(number, -1,-1):
#     print(i)


for i in range(number, -1,-1):
   # for j in range(number, -1,-1)
    print(i, number, number-1)







# count = 3
# for i in range(count):
#     for j in range(count):
#         for k in range(count):
#             print(i, j, k)